[
  {
    "version": "v3.1.1",
    "date": "21st February, 2017",
    "features": [],
    "bugs": [
      "Fix Google security vulnerabilities alert warning."
    ]
  },
  {
    "version": "v3.1.0",
    "date": "21st February, 2017",
    "features": [
      "Added firebase crash reporting support.",
      "Added progressbar to the notification message when synchronizing a message.",
      "Upgraded Raiburai.",
      "Added privacy notice link to settings about screen.",
      "Log messages for gained and lost data connectivity."
    ],
    "bugs": [
      "Fixed issue with imported messages getting synchronized multiple times.",
      "Cleaned up major parts of the code base.",
      "Fixed checkbox flipping animation.",
      "Fixed issue with whitelist causing duplicated messages synchronization."
    ]
  },
  {
    "version": "v3.0.5",
    "date": "12th February, 2016",
    "features": [],
    "bugs": [
      "Fixed so app uses the devices phone number as the  value for the sent_to field not the from number.",
      "Fixed so individual messages can be synchronized.",
      "Fixed duplication of messages when task checking is enabled.",
      "Fixed Test Integration from always reporting wrong endpoint is entered."
    ]
  },
  {
    "version": "v3.0.4",
    "date": "20th November, 2015",
    "features": [
    ],
    "bugs": [
      "Fixed app crashing on certain devices due to a bug in the support library.",
      "Fixed regression with Reply From Server feature.",
      "Fixed POST request variable being duplicated upon every request made."
    ]
  },
  {
    "version": "v3.0.3",
    "date": "9th November, 2015",
    "features": [
      "Change delete icon from grey to white to make it more visible on the actionbar."
    ],
    "bugs": [
      "Fix Class not found exception due to a bug in the build system.",
      "Fixed a lot of crashes as reported on Google Playstore console.",
      "Fixed so imported messages are persisted in the incoming list.",
      "Fixed so time frequency set on settings screen can be okayed and saved.",
      "Fixed so you can disable a custom web service so it can be deleted.",
      "Fixed fork me badge on the website. Hide it on mobile."
    ]
  },
  {
    "version": "v3.0.2",
    "date": "19th October, 2015",
    "features": [
    ],
    "bugs": [
      "Fix Class not found exception due to compilation error"
    ]
  },
  {
    "version": "v3.0.1",
    "date": "19th October, 2015",
    "features": [
    ],
    "bugs": [
      "Fix Class not found exception due to compilation error"
    ]
  },
  {
    "version": "v3.0.0",
    "date": "19th October, 2015",
    "features": [
      "Improved app look and feel for better experience.",
      "Added support for adding new web service via a QR code scanner",
      "Renamed Sync URL as Web Service.",
      "Renamed Pending as Incoming.",
      "Added ability to test Web service configuration.",
      "Added support for Twitter. Now you can tweet SMS.",
      "Properly organized settings screen.",
      "Moved legacy code into a more structured code base.",
      "Put filters and keywords into their own screen.",
      "Added a product tour that shows up when app is launched for the first time.",
      "Switched to using OkHttp as the HTTP client.",
      "Added ability to swipe on a list item to perform a corresponding action. Eg. Delete an item.",
      "Added ability to add a name for the device in addition to its ID.",
      "Dropped support for minSDK 8. App works for minSDK 9 and above."
    ],
    "bugs": [
      "Lots of bug fixes"
    ]
  },
  {
    "version": "v2.8.3",
    "date": "17th June, 2015",
    "features": [],
    "bugs": [
      "Fix issue with app crashing because of unnecessary definition of otto bus @Producers",
      "Fix issue with app crashing because otto bus is not properly registered.",
      "Fix issue with app sporadically crashing when you invoke navigation drawer."
    ]
  },
  {
    "version": "v2.8.2",
    "date": "9th June, 2015",
    "features": [],
    "bugs": [
      "Upgrade otto to v1.3.7 to fix synthetic bridge methods created by JDK 8",
      "Fix issue when messages received from server is empty."
    ]
  },
  {
    "version": "v2.8.1",
    "date": "5th June, 2015",
    "features": [],
    "bugs": [
      "Fixed Navigation drawer. Items not showing on older devices.",
      "Fixed alert code sending wrong info when querying for battery level."
    ]
  },
  {
    "version": "v2.8.0",
    "date": "4th May, 2015",
    "features": [
      "Allow alert phone number field to accept international dialing prefix.",
      "Styled app support API level 10 and below.",
      "Added Android 5.1 support.",
      "Enabled auto deletion of pending of messages after a configured number of retry is exceeded.",
      "Updated Japanese, German and Indonesian translations.",
      "Refreshes Sync URL list view when a new Sync URL is added.",
      "Re-activated donation button.",
      "Brought back HTTP client support for devices running Android v2.2."
    ],
    "bugs": [
      "Fixed inconsistency with Message Result API codes.",
      "Fixed issue with multi Sync URL support.",
      "Fixed issue with date format being null.",
      "Fixed logs not propagating with activities.",
      "Fixed Alert Debug crashing when the app receives a query code.",
      "Fixed so Message Result API is started from the settings screen when enabled."
    ]
  },
  {
    "version": "v2.8.0-rc.1",
    "date": "Apr 20, 2015",
    "features": [
      "Allowed alert phone number field accept international dialing prefix",
      "Styleed app for API level 10 and below to display edittext hint text properly"
    ],
    "bugs": [
      "Fixed donation list to display both the donation title and the amount.",
      "Fixed so task and message results when enabled from settings screen actually starts.",
      "Fixed data migration from v2.7.3 to v2.8.0"
    ]
  },
  {
    "version": "v2.8.0-beta.1",
    "date": "Mar 30, 2015",
    "features": [],
    "bugs": [
      "Fixed donation screen crashing on Lollipop devices.",
      "Fixed random stalls of enabled services.",
      "Fixed retries so it only deletes pending message when it's enabled"
    ]
  },
  {
    "version": "v2.8.0-alpha.3",
    "date": "Mar 25, 2015",
    "features": [
      "Styled ActionMode background to accommodate changes in the new theme."
    ],
    "bugs": [
      "Fixed logs not propagating.",
      "Fixed Sync URL list view to reload when a new Sync URL is added.",
      "Fixed alert debug crashing when the app receives a key code."
    ]
  },
  {
    "version": "v2.8.0-alpha.2",
    "date": "March 23, 2015",
    "features": [
      "Added Japanese German and Indonesian translations"
    ],
    "bugs": [
      "Fixed inconsistency with message result API codes.",
      "Fixed issue with sync to only one Sync URL even though multiple have been enabled.",
      "Disabled proguard minification"
    ]
  },
  {
    "version": "v2.8.0-alpha.1",
    "date": "March 23, 2015",
    "features": [
      "Added Android 5.1 support.",
      "Enabled auto delete of pending of message after a configured number of retry is exceed.",
      "Brought back HTTP client support for devices running Android v2.2.",
      "Re-activated donation button."
    ],
    "bugs": [
      "Fixed inconsistency with message result API codes.",
      "Fixed issue with sync to only one Sync URL even though multiple have been enabled."
    ]
  },
  {
    "version": "v2.7.3",
    "date": "January 12, 2015",
    "features": [
      "Refactored how responses from server are processed.",
      "Switched to using GSON for JSON de/serializations.",
      "Remove survey feedback form.",
      "Switched to using OkHttp library as the main http client.",
      "Started using mockito for testing.",
      "Added more debug info to log messages."
    ],
    "bugs": [
      "Fixed issue with server not sending message from server as SMS.",
      "Fixed broken sync scheme's configurations.",
      "Fixed so message result api processes the response."
    ]
  },
  {
    "version": "v2.7.2",
    "date": "December 02, 2014",
    "features": [
      "Added secret to result API",
      "Updated failed notification icon.",
      "Changed message result API to use the same time frequency as task checking feautre. "
    ],
    "bugs": [
      "Fixed wrong use of result API GET param.",
      "Fixed potential null pointers exceptions.",
      "Updated website documentation to match result API's request param."
    ]
  },
  {
    "version": "v2.7.1",
    "date": "November 11, 2014",
    "features": [
      "Updated website with demo code showing how to integrate the message result API",
      "Updated failed notification icon.",
      "Changed Message Results API query string from task=results to task=result",
      "Changed Message Results API JSON property from message_uuid to uuid"
    ],
    "bugs": [
      "Fixed a bug with message result API.",
      "Fixed issue with feedback dialog not sending email addresses.",
      "Updated website documentation to match required JSON structure.",
      "Fixed feedback dialog so it only validate for the email address field when user hit the positive button."
    ]
  },
  {
    "version": "v2.7",
    "date": "October 27, 2014",
    "features": [
      "Added Alerts & Debug which essentially allows you to get status of the device running SMSsync remotely by sending query codes as SMS to the device.",
      "Message Results API, allows SMSsync to send SMS delivery reports back to the server and makes it easier to for the server to know if outgoing messages got sent to the recipients.",
      "Added ability to toggle SMS delivery reports. Now you can turn this feature on or off as some providers charge you for it.",
      "Change from SMSSync to SMSsync. Feels more natural writing it that way.",
      "Updated logo. We have updated our logo to make it modern looking and to conform to Android's design guidelines.",
      "Updated notification status icon to conform to Android's design guidelines.",
      "Added a feedback dialog as a way to engage more with our users to figure out a better way to support them.",
      "Updated website with favicon."
    ],
    "bugs": [
      "Fixed bug with changing the sync scheme not being effected.",
      "Fixed a bug when SMSsync attempt to send an SMS to users it crashes in the background.",
      "Fixed issue with not being able to delete selected whitelist and blacklist entries.",
      "Fixed issue with not being able to delete all messages in the sent list."
    ]
  },
  {
    "version": "v2.6.1",
    "date": "June 23, 2014",
    "features": [
      "Added device id ",
      "Removed beta tag from version number"
    ],
    "bugs": [
      "Fixed task checking not executing",
      "Changed scheduler frequency time to support hour and minutes not minutes and seconds"
    ]
  },
  {
    "version": "v2.6",
    "date": "June 19, 2014",
    "features": [
      "Replaced Action Bar Sherlock library with ActionBarCompat support library.",
      "Upgraded Google Analytics library to V3.",
      "Replaced the dropdown widget which is used for setting the frequencies for the schedulers with a time picker widget. Now you can set any time for the schedulers and not restricted to the predefined ones.",
      "Now Task messages appear in the pending tray before they are attempted to be sent as SMS. This makes it possible to automatically or manually processed them when they fail to be sent as SMS.",
      "Action Bar Contextual Menu now has 'selected' appended to the selection count label. Makes reading the count more meaningful.",
      "Added KitKat, Android 4.4.x support. Now you can set SMSSync as your default messaging app."
    ],
    "bugs": [
      "Fixed duplicate call to ‘readLogs @Produce’ function which causes the application to crash unexpectedly.",
      "Fixed issues with configured secret key not able to match with the one set on the server when it has spaces.",
      "Fixed issue with app crashing on some devices when checking for a connection before attempting a sync process after the device has finished booting."
    ]
  },
  {
    "version": "v2.5.1",
    "date": "November 14, 2013",
    "features": [],
    "bugs": [
      "Fixed issue with app crashing when up attempts to read certain device's phone number",
      "Fixed a wrong timestamp showing when a sync hasn't been run before"
    ]
  },
  {
    "version": "v2.5",
    "date": "November 14, 2013",
    "features": [
      "Added log viewer feature. This logs verbosely the activities that are happening when the app is running.",
      "Added ability to configure different format for the sync scheme. Now JSON, XML and URLEncoded are supported.",
      "Added Basic Auth to Sync URL. Now you can authenticate request from SMSSync",
      "Updated Ukrainian strings. SMSSync is now fully translated into Ukrainian"
    ],
    "bugs": [
      "Refactored existing HTTP client code. Made it easier to read maintain",
      "Fixed issue with task check not working when there is no secret key set.",
      "Fixed a lot of internal bugs"
    ]
  },
  {
    "version": "v2.4",
    "date": "August 12, 2013",
    "features": [
      "Added secret key as GET variable when invoking the GET Task feature.",
      "Added navigation drawer.",
      "How number of items in the list view.",
      "Moved heavy operations off the main UI thread. This has improved speed greatly.",
      "Added ability to filter phone number so you can either blacklist or whitelist a phone number.",
      "Refactored most of the code to make them testable.",
      "Dropped API level 7 support."
    ],
    "bugs": [
      "Fixed issue with \"Get Response From Server\" feature.",
      "Fixed issue with smssync service not turning off."
    ]
  },
  {
    "version": "v2.3",
    "date": "June 27, 2013",
    "features": [
      "Manually synchronizing pending messages now shows a progress bar.",
      "Added ability to cancel a progressive synchronization.",
      "Added user agent header to all HTTP requests."
    ],
    "bugs": [
      "Fix crashes when synchronizing huge pending messages",
      "Fix incorrect date display in sent inbox",
      "Fix duplicate reply responses."
    ]
  },
  {
    "version": "v2.0.2",
    "date": "March 30, 2013",
    "features": [
      "Show confirmation prompt when attempting to import SMS",
      "Added RegExp support to keyword filtering.",
      "Added more useful HTTP and server error messages",
      "Simplified the actionbar menu. Only show the relevant menus",
      "Updated notification code to make use of the notification.compact library",
      "Added Russian, Ukrainian, Belarusian languages"
    ],
    "bugs": [
      "Fixed wifi lock issue. See #56",
      "Improved wording and typos in the strings file",
      "Disable excessive 'no task enabled' notifications",
      "Fixed ID issue. Now uses UUID instead. See #60",
      "Fixed issue with auto sync failing."
    ]
  },
  {
    "version": "v2.0.1",
    "date": "October 22, 2012",
    "features": [
      "Resizable widgets to fit on most screens.",
      "Upgraded ABS library to 4.2.0.",
      "Added Korean translation"
    ],
    "bugs": [
      "Fixed an issue with pending messages. See issue #44",
      "Removed screen restriction support from manifest file. This is to allow it to show up on the Google play store for most devices."
    ]
  },
  {
    "version": "v2.0.0",
    "date": "October 15, 2012",
    "features": [
      "Improved the UI. Optimized it to scale well on tablet devices.",
      "Added the ability to manage multiple Sync URLs and the ability to sync messages to them.",
      "Added icons to actionbar menu instead of just text.",
      "Cleaned up code based making it more modular and easier to maintain.",
      "Increased the frequency times for the various schedulers. Added 1 minute, 2 minutes, 3 minutes and 4 minutes.",
      "Dropped support for devices running 1.6. This is to allow us to take advantage of the new Android APIs"
    ],
    "bugs": [
      "Fixed task checking issue. It now frequently pings client for tasks.",
      "sent_timestamp variable  now sends the raw timestamp instead of the preformatted one. This is to allow the client to have control of the formatting",
      "Removed the characters contrains to Unique ID field."
    ]
  },
  {
    "version": "v1.1.9",
    "date": "December 12, 2012",
    "features": [],
    "bugs": [
      "Fixed HTTPS not working on some devices.",
      "Fixed sent_to variable not sending the device's number.",
      "Fixed formatting issue with sent_timestamp."
    ]
  },
  {
    "version": "v1.0.9",
    "date": "November 10, 2011",
    "features": [],
    "bugs": [
      "Fixed HTTPS not working on some devices.",
      "Fixed sent_to variable not sending the device's number.",
      "Fixed formatting issue with sent_timestamp."
    ]
  },
  {
    "version": "v1.0.8",
    "date": "October 27, 2011",
    "features": [],
    "bugs": [
      "Fixed HTTPS not working on some devices.",
      "Fixed sent_to variable not sending the device's number.",
      "Fixed formatting issue with sent_timestamp."
    ]
  },
  {
    "version": "v1.0.8",
    "date": "October 27, 2011",
    "features": [
      "Added filtering when importing SMS.",
      "Added sent_to variable so the server can receive the phone number the SMS was sent to.",
      "Added message_id variable so the server can receive the unique id of the SMS.",
      "Added full HTTPS support."
    ],
    "bugs": [
      "Fixed issue with app widget not updating  view when pending messages are in the view.",
      "Improved performance with syncing pending messages."
    ]
  },
  {
    "version": "v1.0.7",
    "date": "September 25, 2011",
    "features": [
      "Added 5 new languages. Swahili, Dutch, Hungarian, German and Italian.",
      "Added UTF-8 support when submitting messages."
    ],
    "bugs": []
  },
  {
    "version": "v1.0.6",
    "date": "March 03, 2011",
    "features": [
      "Added improvement that makes th battery consumption by the app.",
      "Added the ability for enabled services to automatically start after the phone boots up.",
      "Added the ability for the App to lock WiFi connection when the phone is connected to a WiFi.",
      "Added the ability for 'response messages' to be received from the server and not wait on a scheduler.",
      "Added confirmation dialog when performing delete actions.",
      "Added a tab that habours 'pending messages' view and 'sent messages' view.",
      "Added the ability for the app to log recent sent messages. Twenty is the Max.",
      "Added 'sent_timestamp' post variable in order to send the timestamp of an SMS.",
      "Added App widget support."
    ],
    "bugs": [
      "Fixed a bug that when all messages are deleted, the app shows a failed message yet the messages are deleted.",
      "Fixed the issue of pending messages' view not updating when pending messages are deleted from a background service."
    ]
  },
  {
    "version": "v1.0.5",
    "date": "February 25, 2011",
    "features": [
      "Scheduler automatically Syncs pending messages to the configured Callback URL.",
      "Now sends out messages from the configured callback URL as text message.",
      "Imports messages from Android messages app inbox for synchronizing to the configured callback URL.",
      "Added context menu for deleting or synchronizing pending messages."
    ],
    "bugs": [
      "Improved callback URL validation process; Added more checks. Empty, malformed and connection checks.",
      "More sanity checks before SMSSync can be enabled.",
      "Known issue: Scheduler doesn't refresh pending messages' list after it runs. The pending messages screen needs to be restarted."
    ]
  },
  {
    "version": "v1.0.4",
    "date": "January 29, 2011",
    "features": [
      "Notification cannot be cleared untill SMSSync is stopped.",
      "Failed Messages now get sent to the outbox folder for later manual syncing when data connection is lost."
    ],
    "bugs": []
  },
  {
    "version": "v1.0.3",
    "date": "January 12, 2011",
    "features": [
      "Downgraded to Android 1.6 so smssync works from 1.6 and above.",
      "Now sms can be deleted from the sms inbox. This is a configurable option.",
      "Fixed issue with the secret variable.",
      "Better support for localization - All hardcoded strings have been moved to the string.xml file.",
      "Supports outbox -- for pending messages that manually needs to be synced.",
      "Improved SMS background service -- Now it starts and stops perfectly.",
      "Added version number to the powered by text on the Settings screen.",
      "Changed notification Icon to SMSSync's slick launch icon.",
      "Shows status of Pending messages. Whether there are pending messages or not.",
      "Prepopulates URL field with 'http://' when setting up the sync URL.",
      "Sends an auto response once the SMS is recieved. This is a configurable option.",
      "Validates the callback URL"
    ],
    "bugs": []
  }
]